Revit 2026 API

# ScheduleDefinitionIsFilteredBySheet Property

---

Indicates if the schedule is set to filter by sheet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsFilteredBySheet { get; set; }
```
```vb
Public Property IsFilteredBySheet As Boolean
	Get
	Set
```
```cpp
public:
property bool IsFilteredBySheet {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsFilteredBySheet : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: The schedule category is not supported to use filter by sheet. -or- When setting this property: The Schedule is split already. |

If the schedule is set to filter by sheet, and it is placed on a particular sheet, the instance created will present only the elements visible in the Viewport(s) on that sheet.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace